Function Reference

# Dialogs - Modern - Browser

| | | |
|---|---|---|
| AddLBImage <sub>*obsolete in Vectorworks 2012*</sub> | AddLBOriginalName | AddListBrowserImage |
| AreLBColumnLinesEnabled | AreLBRadioColumnLinesEnabled | CollapseAllLBItems |
| CreateLB | DeleteAllLBItems | DeleteLBColumn |
| DeleteLBItem | EnableLB | EnableLBClickAllDataChange |
| EnableLBColumnLines | EnableLBColumnTracking | EnableLBDragAndDrop |
| EnableLBExternalSort | EnableLBHierDisplay | EnableLBRadioColumnLines |
| EnableLBSingleLineSelection | EnableLBSorting | EnableLBUpdates |
| EnsureLBItemIsVisible | ExpandAllLBItems | FindLBColumnDataItem |
| FindLBColumnItem | GetLBColumnDataItemInfo | GetLBColumnHeaderJust |
| GetLBColumnHeaderToolTip | GetLBColumnOwnerDrawnType | GetLBColumnSortState |
| GetLBColumnWidth | GetLBControlType | GetLBEditDisplayType |
| GetLBEventInfo | GetLBItemByClass | GetLBItemDashStyle <sub>*obsolete in Vectorworks 2019*</sub> |
| GetLBItemData | GetLBItemDisplayType | GetLBItemFillBackColor |
| GetLBItemFillForeColor | GetLBItemGradientOrImageRefNumber | GetLBItemHatchRefNum |
| GetLBItemInfo | GetLBItemLineType | GetLBItemMkrByClass |
| GetLBItemMkrChoice | GetLBItemOrigName | GetLBItemPatternIndex |
| GetLBItemPenBackColor | GetLBItemPenForeColor | GetLBItemTextColor |
| GetLBItemTextJust | GetLBItemTextStyle | GetLBItemTileRefNum |
| GetLBMultImageIndexes | GetLBOrigNameClLevel | GetLBSortColumn |
| GetNumLBColumnDataItems | GetNumLBColumns | GetNumLBItems |
| GetNumSelectedLBItems | HierLBItemClosed | HierLBItemIsClosed |
| HierLBItemIsContain | HierLBItemOpened | InsertLBColumn |
| InsertLBColumnDataItem | InsertLBItem | IsLBColumnTrackingEnabled |
| IsLBDisplayHier | IsLBItemReadOnly | IsLBItemSelected |
| IsLBReadOnly | IsLBResOnlyCurDoc | IsLBSortingEnabled |
| RefreshLB | RemoveAllLBColumnDataItems | RemoveLBColumnDataItem |
| SetFocusOnLB | SetLBColumnHeaderJust | SetLBColumnHeaderToolTip |
| SetLBColumnImage | SetLBColumnOwnerDrawnType | SetLBColumnWidth |
| SetLBControlType | SetLBDragDropColumn | SetLBEditDisplayType |
| SetLBHierDispColumn | SetLBItemByClass | SetLBItemDashStyle <sub>*obsolete in Vectorworks 2019*</sub> |
| SetLBItemData | SetLBItemDisplayType | SetLBItemFillBackColor |
| SetLBItemFillForeColor | SetLBItemGradientOrImageRefNumber | SetLBItemHatchRefNum |
| SetLBItemInfo | SetLBItemInteracType | SetLBItemLineType |
| SetLBItemMkrByClass | SetLBItemMkrChoice | SetLBItemPatternIndex |
| SetLBItemPenBackColor | SetLBItemPenForeColor | SetLBItemReadOnly |
| SetLBItemTextColor | SetLBItemTextColorN | SetLBItemTextJust |
| SetLBItemTextStyle | SetLBItemTileRefNum | SetLBItemUsingColumnDataItem |
| SetLBMultImageIndexes <sub>*obsolete in Vectorworks 2012*</sub> | SetLBNumericItemInfo | SetLBOrigNameClLevel |
| SetLBReadOnly | SetLBResOnlyCurDoc | SetLBSelection |
| SetLBSortColumn | ShowLBHeader | ShowLBItemByClassOpt |
| ShowLBItemMkrByClass | ShowLBItemMkrEditLst